{
  "title": "The cost of NO UX",
  "short": "<em>How much does UX* cost? &nbsp;</em><em>Why do we need UX?</em>",
  "text": "<p>by Iain Duncan (@Iain_Duncan)</p>\n\n<p>&nbsp;</p>\n\n<p><em>&quot;How much does UX* cost?&quot; Is one of the most commonly asked questions and is normally preceded by &quot;Why do we need UX?&quot;</em></p>\n\n<p>&nbsp;</p>\n\n<p>To answer the question of cost itʼs probably best to take an &quot;outside in&quot; approach. After all, the person using your product or software sees it from the outside in. They donʼt actually care about how the code was written, or how your lead programmer thought it would be clever to add a talking paperclip to the final product. All the customer wants is something that works, is forgiving of their mistakes and is a joy to use</p>\n\n<p>Cost can be looked at in the same way. By seeing how much a company stands to lose, or is losing already by not incorporating UX into their product and business development, you can see how much UX is worth.</p>\n\n<p>Taking the &quot;Outside In&quot; or &quot;Front to Back&quot; approach to the cost justification of UX is one that lies in the truth that your users experience your product that way around. So letʼs look at the cost of having NO UX , rather than the antithesis.</p>\n\n<p><em>(Disclaimer: We are a company based in Cape Town, South Africa and Zurich, Switzerland so therefore have used local currencies as well as USD in the following examples.)</em></p>\n\n<p>TeleHit a fictional mobile phone operator based in South Africa has developed a new website (with no UX design) for their customers that has produced the following results:</p>\n\n<p>&nbsp;</p>\n\n<ul style=\"list-style-type:none\">\n\t<li>A development cost for the website of ZAR 1.5 million / CHF 140 000 / USD 148 368</li>\n\t<li>A quarter of the development budget (ZAR 375 000 / CHF 35 000 / USD 37 092 ) was spent on features for the website that are only used by 10% of customers.</li>\n\t<li>The time spent on the the lesser used features above meant a delay in getting to market and thus a loss in potential sales of the new iPhone that was calculated at ZAR 500 000 / CHF 47 000 / USD 49 50</li>\n\t<li>An additional website development cost of ZAR 150 000 / CHF 14 000 / USD 14 900 to refine/clear out the confusing features above.</li>\n\t<li>160 more phone calls per week to their call centre with questions about how to use the very confusing on-line ordering system at a cost of ZAR 32 / CHF 3 / USD 3.20 per call to the company, that totals ZAR 20 480 / CHF 1 900 / USD 2025 per month</li>\n\t<li>The lost time and productivity of their call centre to handle sales based calls, or profit making calls, rather than website based queries.</li>\n\t<li>Around 160 frustrated potential customers per week that left the website and went to direct competitors.</li>\n\t<li>The increased cost of having to run more brick and mortar stores to answer client queries and provide sales assistance because the website could not take on this workload adequately.</li>\n\t<li>The loss of trust in their brand...priceless</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>This is an extreme case to make my point and it must be said that doing good UX wouldnʼt mean that all the costs above would magically vanish or that a bad User Experience is to blame for every part of these losses. Looking at this conservatively even a 10% reduction would be a big saving. This example almost says it all, but just in case it doesnʼt, hereʼs a list, mmmmmm we all love lists.</p>\n\n<p>&nbsp;</p>\n\n<h2>The cost of having no UX can be broken down into the following:</h2>\n\n<h3>Development</h3>\n\n<ol>\n\t<li>Increased development time</li>\n\t<li>More late changes</li>\n\t<li>Incorrect features and functionality</li>\n\t<li>Frequent requests for changes by users</li>\n\t<li>Future versions and a boatload of fixes</li>\n</ol>\n\n<h3>Sales</h3>\n\n<ol>\n\t<li>Difficult to use product</li>\n\t<li>Reduced competitive edge</li>\n\t<li>Fewer satisfied customers</li>\n\t<li>Less repeat business</li>\n\t<li>Bad press</li>\n</ol>\n\n<h3>Use</h3>\n\n<ol>\n\t<li>Loss in productivity</li>\n\t<li>More training time needed</li>\n\t<li>More user errors</li>\n\t<li>Lessened quality of service</li>\n\t<li>High customer turnover</li>\n</ol>\n\n<h3>Support</h3>\n\n<ol>\n\t<li>Cost of producing more training materials</li>\n\t<li>Help line/call center costs increase</li>\n\t<li>Help line/call center workload increase</li>\n</ol>\n\n<p>Even lists can be a bit overwhelming so hereʼs the short and sweet version:</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<blockquote>Put money into meeting user needs&nbsp;<br />\n=<br />\nGet more money out, through increased revenue and reduced costs</blockquote>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<h2 style=\"text-align:center\">* Just what is User Experience (UX)?</h2>\n\n<p style=\"text-align:center\">&quot;User eXperience (UX) is about how a person feels about using a system. User experience highlights the experiential, affective, meaningful and valuable aspects of human-computer interaction (HCI) and product ownership, but it also covers a person&rsquo;s perceptions of the practical aspects such as utility, ease of use and efficiency of the system. User experience is subjective in nature, because it is about an individual&rsquo;s performance, feelings and thoughts about the system. User experience is dynamic, because it changes over time as the circumstances change.&quot;&nbsp;<br />\n- Wikipedia</p>\n\n<p style=\"text-align:center\">&quot;All aspects of the end-user&rsquo;s interaction with the company, its services, and its products. The first requirement for an exemplary user experience is to meet the exact needs of the customer, without fuss or bother. Next comes simplicity and elegance that produce products that are a joy to own, a joy to use. True user experience goes far beyond giving customers what they say they want, or providing checklist features. In order to achieve high-quality user experience in a company&rsquo;s offerings there must be a seamless merging of the services of multiple disciplines, including engineering, marketing, graphical and industrial design, and interface design.&quot;&nbsp;<br />\n- Nielsen-Norman Group</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n",
  "id": "en-the-cost-of-no-ux",
  "updatedAt": "2013-08-12T08:38:59.077Z",
  "createdAt": "2013-08-12T15:40:15.151Z",
  "meta": {
    "title": "glint cms",
    "description": "the invisible cms"
  },
  "locale": "en",
  "path": "the-cost-of-no-ux"
}